// Задача 19. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
/*int[] newArray(int size)
{
    int[] newArray = new int [size]:
    int size = 5;
    Console.WriteLine("Запишите свой массив:  ");

    for (int i=0; i <= size; i++)
    {
        Console.Write($"Введите {i+1} элемент:  ");
        newArray [i] = Convert.ToInt32(Console.ReadLine());
    }
        
    Console.WriteLine();
    return newArray
}
Console.WriteLine("Сообщите свое число: ");
int number = Convert.ToInt32(console.ReadLine());
{
    if (array [0] = array [4] && array [1] = array [3]);
    Console.WriteLine("Ваше число является палиндромом")
}
{
    if (array [0] != array [4]) Console.WriteLine("Ваше число - не палиндром!")
}

*/


// Задача 23. Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

/*int tablicaKubov(int i, int N, int m, int j)
{
    for (int i=1; i <= N; i++);
    int j = 3;

    Console.WriteLine($"{i}^{j}={i^j}");
    return tablicaKubov
}
Console.WriteLine();

Console.WriteLine("Введите ваше число:  ");
int num = Convert.ToInt32(Console.ReadLine());

int tablicaKubov(num);
*/

