// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
/*void SecondNumVoid (int number, int m, int n)
{
    int number = new Random().Next(100;1000);
    Console.WriteLine("Текущее число " + number);
    int m = number / 10;
    int n = m % 10;
}
 return n;

SecondNumVoid()
*/


// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
/*int IndexOf(int[]collection, int find)
{
    int count = 3;
    int index = 0;
    int position = 0;
    while (index < count)
    {
        if (collection [index] == find)
        {
            position = index;
        }
    }
        index ++;
    return position;
}

Console.WriteLine("Input number;");
int num = Convert.ToInt32(Console.ReadLine());

IndexOf(num);
*/


// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

/*void WeekendOrNot (int numday)
{
    if (numday >= 1 && numday <= 7);
    {
        if (numday >= 1 && numday <= 5) Console.WriteLine ("This day is weekday");
        if (numday >= 6 && numday <= 7) Console.WriteLine("This day is weekend");
    }
}
Console.WriteLine("Input a number day");
int numday = Convert.ToInt32(Console.ReadLine());

WeekendOrNot(numday);
*/