// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.



// Задача 29: Напишите программу, которая задаёт массив из m элементов и выводит их на экран.
/*int [] RandomMassive (int m, int minValue, int maxValue)
{
    int [] newMassive = new int [m];
    for (int i = 0; int i< m; i++);
    
    newMassive [i] = new Random().Nex(minValue, maxValue+1)
return newMassive (int[]array)
}
void newMassive (int[]array)
{
    for (int i=0; i<array.Length; i++) Console.Write("Array[i]+ "  );

Console.WriteLine();
}
    
Console.WriteLine("Введите размер массива:  ");
int m = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите минимальный предел массива:  ");
int minValue = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите максимальный предел массива:  ");
int maxValue = Convert.ToInt32(Console.ReadLine());

int RandomMassive(m);
*/



